[
    {
        "title": "Skill Course: Cooking",
        "quote": "In the Sixth Grade Life and Livelihood book, there is a chapter titled \"Skill Course - Cooking,\" which outlines the step-by-step process of preparing simple dishes like rice, fried eggs, and mashed potatoes. This chapter is designed to teach students essential cooking skills in a practical and accessible way. Our students went beyond the textbook by dividing themselves into different groups and preparing a variety of exciting dishes. Some students cooked noodles, others made pudding, and some even prepared chatpati. This allowed the students to explore creativity in cooking while building their practical skills. After cooking, each group presented their dishes to the class, where they shared the detailed recipes, ingredients, and costs involved. Students also discussed their personal experiences, highlighting challenges faced during cooking and what they learned throughout the process. This exercise not only enhanced their cooking abilities but also improved their teamwork, communication, and problem-solving skills, preparing them for a well-rounded future.",
        "image_url": "/images/empowerment/cooking.png"
    },
    {
        "title": "Swing Machine Training Program",
        "quote": "To empower underprivileged women with self-sustaining skills, Daily Ten School has introduced a Swing Machine Training Program for mothers and young girls. This initiative provides hands-on training in sewing, allowing participants to acquire a valuable skill that can support their families financially. \n\n Each batch consists of 30 participants, including both local women and senior students from our campuses. Over a three-month period, they receive practical sewing lessons from experienced trainers. Additionally, efforts are made to provide sewing machines to participants upon course completion, helping them start their own income-generating activities. \n\n This initiative is a significant step towards women's empowerment and economic independence, enabling them to build a better future for themselves and their families.",
        "image_url": "/images/empowerment/swing.png"
    },
    {
        "title": "Curriculum Based Teachers Training",
        "quote": "To further strengthen our commitment to providing high-quality education, Daily Ten School recently organized an additional Curriculum-Based Teachers Training session for our dedicated educators across all campuses.\n\n This second round of training was focused on deepening teachers' understanding of the new curriculum and ensuring they are equipped to adapt to the evolving educational needs of our students. Our educators were trained to deliver lessons more effectively, ensuring underprivileged children receive the same high standard of education as their peers.\n\n This training reflects our continuous efforts to raise the quality of education at Daily Ten School and provide our students with the best possible foundation for their future. ",
        "image_url": "/images/empowerment/teacher-training.png"
    },
    {
        "title": "Leadership Training",
        "quote": "Effective school management requires a principal to oversee every aspect of the institution—from guiding and managing the teaching staff to maintaining strong relationships with parents. To enhance the leadership capabilities of our principals, Daily Ten School organized a Leadership Training session for the heads of all our campuses. This training was specifically designed to refine and strengthen their leadership skills, enabling them to manage their teams and responsibilities more efficiently. The training not only focused on practical leadership techniques but also aimed to foster a more conducive environment for professional development.\n\n By empowering our principals with enhanced leadership skills, we are reinforcing our commitment to maintaining a standard of excellence in education and providing the best possible learning environment for all our students.",
        "image_url": "/images/empowerment/leader.png"
    }
]